# Задание-1:
# Напишите функцию, округляющую полученное произвольное десятичное число
# до кол-ва знаков (кол-во знаков передается вторым аргументом).
# Округление должно происходить по математическим правилам (0.6 --> 1, 0.4 --> 0).
# Для решения задачи не используйте встроенные функции и функции из модуля math.

def my_round(number, ndigits):
    pass


print(my_round(2.1234567, 5))
print(my_round(2.1999967, 5))
print(my_round(2.9999967, 5))


# Задание-2:
# Дан шестизначный номер билета. Определить, является ли билет счастливым.
# Решение реализовать в виде функции.
# Билет считается счастливым, если сумма его первых и последних цифр равны.
# !!!P.S.: функция не должна НИЧЕГО print'ить

def lucky_ticket(ticket_number):
    number_tickets = str(ticket_number)
    if len(number_tickets)< 6:
        return ticket_number
    first_part = int(number_tickets[0])+int(number_tickets[1])+int(number_tickets[2])
    second_part = int(number_tickets[3]) + int(number_tickets[4]) + int(number_tickets[5])
    if first_part == second_part:
        return ticket_number
    else:
        return ticket_number
